[
  {
    "name": "Amit Kumar",
    "image": "amit-kumar.jpeg",
    "companies": [
      "google.svg"
    ],
    "ctc": "30L-35L",
    "review": "It was a really very good experience. Placewit helped me to build a strong base regarding data structures and algorithms. I have got more used to programming and associated thinking and logical skills.",
    "links": {
      "quora": "https://qr.ae/pGSZIF",
      "youtube": "https://youtu.be/2G7FFmufBto"
    }
  },
  {
    "name": "Aditya Raj Sharma",
    "image": "aditya-raj-sharma.jpeg",
    "companies": [
      "amazon.png"
    ],
    "ctc": "40L-45L",
    "review": "Placewit helped me a lot that I can't even express. I felt zero in coding at some phase of time in my college and now the situation has changed immensely. They conducted mock interviews, which really helped me a lot in my preparation for the interviews, which I consider one of the many reasons for my growth. I will always be grateful to Placewit for how it impacted my life and helped me to get placed at Amazon. Placewit truly came as a blessing in my life.",
    "links": {
      "quora": "https://qr.ae/pvwNtK"
    }
  },
  {
    "name": "Prabhat Sahani",
    "image": "prabhat-sahani.jpeg",
    "companies": [
      "microsoft.png"
    ],
    "ctc": "45L-50L",
    "review": "Been training with Placewit since January, and it has been a great learning experience. Before I started here, I used to lack confidence and had various fears due to lack of experience. Over the months, I've come to experience a lot and learned a lot, and I can now say I can behave in a much more confident manner when it comes to sitting for any interview. So thank you to all the mentors who have been a great help along the way.",
    "links": {
      "youtube": "https://youtu.be/5aEToatOGyA"
    }
  },
  {
    "name": "Vinitkumar Sanklecha",
    "image": "vinitkumar.jpeg",
    "companies": [
      "amazon.png"
    ],
    "ctc": "40L-45L",
    "review": "I joined placewit to get 100% ready for the placements and I think placewit made it much easy for me to accomplish the targets by guiding me through the right path and providing the right resources required for the preparation. I want to thank placewit for being such a lifesaver and helping me through my placement preparation.",
    "links": {
      "quora": "https://qr.ae/pvew8U"
    }
  },
  {
    "name": "Aditi Gedam",
    "image": "aditigedam.jpeg",
    "companies": [
      "microsoft.png"
    ],
    "ctc": "50L-55L",
    "review": "I am happy to announce that I have been placed in Microsoft as a full-time SWE, and all credit goes to Placewit!! Kudos!!! Now I am more clear with my thoughts. Able to code the logic accurately. I am glad that I came to know about Placewit at the right time. A big shout out to team Placewit. Thank you so much ❤️",
    "links": {
      "quora": "https://qr.ae/pvbjCF"
    }
  },
  {
    "name": "Md Shakir Alam",
    "image": "shakir-alam.jpeg",
    "companies": [
      "amazon.png"
    ],
    "ctc": "30L-35L",
    "review": "I think for me, joining Placewit was the best decision I had taken last year. I would like to thank the whole team to give me this opportunity. Honestly, I had an awesome experience throughout the year. Last year, I knew only C++ language and nothing else. Now, I have improved a lot and was able to get my dream placement. The faculty is excellent. I have learnt a lot from Rishabh sir, special thanks to him. The way he taught us was amazing. In conclusion, I would say that I would recommend my juniors to join this, if anyone finds difficulty in coding.",
    "links": {
      "quora": "https://qr.ae/pGSeuo",
      "youtube": "https://youtu.be/z5s0u8PsLRQ"
    }
  },
  {
    "name": "Sangam Kumar",
    "image": "sangamkumar.jpg",
    "companies": [
      "microsoft.png"
    ],
    "ctc": "50L-55L",
    "review": "I would like to thank Placewit for the awesome teaching on their part which helped me get placed in my dream company Microsoft. I joined Placewit to enhance my coding skills and will surely recommend it to my friends and juniors. There used to be 25 students in my batch and it was a very good experience as the instructor got to know everyone personally and gave attention to everyone. I became a good coder and also gained a lot of confidence!",
    "links": {
      "quora": "https://qr.ae/pvbxvD"
    }
  },
  {
    "name": "Muskan Mishra",
    "image": "muskanmishra.jpeg",
    "companies": [
      "amazon.png"
    ],
    "ctc": "40L-45L",
    "review": "Before joining Placewit I didn't know what to prepare and where and I was very confused about various road maps but Placewit provided good sources and prepared us for an interview and for coding rounds. Joining Placewit was the correct decision for me, and it helped me get placed at the Amazon. I’d recommend it for getting top placements and overall preparation related to every aspect of the placement season. I owe you a lot Placewit!",
    "links": {
      "quora": "https://qr.ae/pvbgmg"
    }
  },
  {
    "name": "Abhishek Kumar",
    "image": "abhishekkumar.jpeg",
    "companies": [
      "microsoft.png"
    ],
    "ctc": "45L-50L",
    "review": "It was a great experience learning here. I've definitely improved a lot since I joined Placewit. If anyone wants to kickstart their journey in coding and want to crack a product based company, I would recommend that you learn from Placewit. Great teaching and great mentoring."
  },
  {
    "name": "Ravikant Vaishnav",
    "image": "ravikant-vaishnav.jpeg",
    "companies": [
      "tekion.png"
    ],
    "ctc": "45L-50L",
    "review": "I am happy to announce I have been placed in Tekion corp as a full-time SWE. All credit goes to Placewit!! Placewit conducted regular mock interviews to make us familiar with the interviews we had to face to get a place in any company. After every interview, I felt the new push to study harder and work on my weak areas.",
    "links": {
      "quora": "https://qr.ae/pvUrxI"
    }
  },
  {
    "name": "Eqbal Khan",
    "image": "eqbal-khan.jpeg",
    "companies": [
      "amazon.png",
      "sapient.png"
    ],
    "ctc": "40L-45L",
    "review": "I would like to thank Placewit for giving me the opportunity to attend such excellent classes and understand the concept deeply. I will definitely give credit to Placewit for making me a perfect candidate for a good company. Through my own hard work and guidance from mentors, and instructors, I was able to crack Amazon.",
    "links": {
      "quora": "https://qr.ae/pvDIvf"
    }
  },
  {
    "name": "Nimmi Diwakar",
    "image": "nimmidiwakar.jpeg",
    "companies": [
      "microsoft.png"
    ],
    "ctc": "50L-55L",
    "review": "Placewit definitely helped me increase my coding skills. It exposed me to a variety of coding questions and concepts. The coding contests helped me to get a habit of that. It cultivated the habit of solving more questions and asking doubts. And also there were selected questions to learn the concepts. I joined placewit to get placed in my dream company and yessss I achieved that ...Microsoft. PLACEWIT WAS A BOON FOR ME.",
    "links": {
      "quora": "https://qr.ae/pvbjG3"
    }
  },
  {
    "name": "Abhishek",
    "image": "abhishekbhatti.jpg",
    "companies": [
      "atlassian.png"
    ],
    "ctc": "35L-40L",
    "review": "I joined placewit on the first place because I was surprised to see that how come they are offering all the core subject knowledge, along with DSA learning, along with Projects and guidance and that too in period of 6-7 months. I myself never did the planned preparation but I thought I’ll be able to have a well planned structure for my preparation if I join placewit. I will highly recommend any of my friend or junior to join placewit because now I can surely say if you'll take the curriculum they are offering seriously, the results are going to be far better than your expectations.",
    "links": {
      "quora": "https://qr.ae/pvJqY7"
    }
  },
  {
    "name": "Aniket Jaiswal",
    "image": "aniket-jaiswal-navi.jpeg",
    "companies": [
      "navi.png"
    ],
    "ctc": "25L-30L",
    "review": "Placewit provided a lot of resources to study from and their curriculum was awesome. They also helped me build confidence which was very much required for interviews and finally due to all the hard work I am so happy to tell that I have been placed in Navi as a full time SDE. I used to be an introvert kinda person but now I feel I’ve become extrovert because now I don’t hesitate to talk to people and give interviews. All thanks to Placewit!!",
    "links": {
      "quora": "https://qr.ae/pvg9Nc"
    }
  },
  {
    "name": "Krishnanunni P",
    "image": "krishnanunni.jpeg",
    "companies": [
      "oracle.png"
    ],
    "ctc": "30L-35L",
    "review": "Placewit is very much helpful for placements. Because it provides everything necessary for placement at one place, one doesn't have to roam around for right resources. Mentors are guiding each individual student at every step.",
    "links": {
      "youtube": "https://youtu.be/Ee0-ijqPyiM"
    }
  },
  {
    "name": "Rahul Singh",
    "image": "rahulsingh.jpg",
    "companies": [
      "atlassian.png"
    ],
    "ctc": "35L-40L",
    "review": "To get placed in my dream company I joined Placewit and feel delighted to say I am placed in my dream company Atlassian.\n\nWithout Placewit’s help and guidance this thing may not have been possible for me. Now I am very much confident to face any interview or coding test. The best thing was the batch size. It was only 25, everyone used to get equal and personal attention.",
    "links": {
      "quora": "https://qr.ae/pvUrl1"
    }
  },
  {
    "name": "Abhishek Babbar",
    "image": "abhishek-babbar.jpeg",
    "companies": [
      "urbancompany.png"
    ],
    "ctc": "30L-35L",
    "review": "Placewit is a great platform to prepare for placements and strengthen your programming as well as soft skills. Mock interviews were also conducted regularly, which boosts the confidence upto a good level. It's been a great journey till now. After completing the course, I was able to crack an amazing placement.",
    "links": {
      "youtube": "https://youtu.be/88eH2GYx2PU"
    }
  },
  {
    "name": "Rakshit Khullar",
    "image": "rakshit-khullar-navi.jpeg",
    "companies": [
      "navi.png",
      "oyo.png"
    ],
    "ctc": "25L-30L",
    "review": "Mr. Amrit sir(SDE @ Sprinklr) was my instructor. He was very good, but his style of teaching was slow for 2-3 months. After that he was very good at teaching. Mr. Abhishek(SWE @ Microsoft) was my mentor. He has helped me very much, and even now he helps me a lot. By taking practice interviews, I became better day by day. I am much more confident about my placements as compared to day one here. Finally, I would like to say thanks to Placewit for the knowledge they could feed in me, and will always remember you guys!!",
    "links": {
      "quora": "https://qr.ae/pvgFue"
    }
  },
  {
    "name": "Ritik Kumar",
    "image": "ritik-kumar-visa.jpeg",
    "companies": [
      "visa.png"
    ],
    "ctc": "30L-35L",
    "review": "Whatever I expected from placewit instructors, they were two-step ahead than I thought. Mentors, Projects (especially Augmented Reality), as well as Whole curriculum, were very disciplined. Joining Placewit was the correct decision for me, and it helped me to get placed at VISA.",
    "links": {
      "quora": "https://qr.ae/pvi333"
    }
  },
  {
    "name": "Jitendra Kaswa",
    "image": "jitendra.jpeg",
    "companies": [
      "rippling.png"
    ],
    "ctc": "30L-35L",
    "review": "My experience with Placewit is one of the best that I ever had on any other platform. The curriculum designed by Placewit helped me a lot to improve my coding skills and getting ready for placements. I loved the teaching methodology of the instructors. Right from the start, they focused on the foundation of the student, they helped to visualize the concepts and how one can apply them in their problem solving approach. The instructors are well versed in their work, they explained each doubt in detail. I would recommend everyone to take this course if they are looking for guidance from learning basics to getting chance to crack top notch software engineering companies."
  },
  {
    "name": "Nitik Garg",
    "image": "nitik-garg.png",
    "companies": [
      "urbancompany.png"
    ],
    "ctc": "30L-35L",
    "review": "Placewit is such a beautiful platform to practice coding. Before joining placewit, I used to have a fear of major topics like dynamic programming, graphs, etc. But now the fear of those concepts has gone entirely. Now I am confident and have the required skills to get into the tech industry and know what are necessary steps to be taken in the future to achieve my dream goals. Placewit helped me a lot in clearing my doubts and provided me confidence while problem-solving.",
    "links": {
      "quora": "https://qr.ae/pvZddw"
    }
  },
  {
    "name": "Emmanuel Thomas",
    "image": "emmanuel.jpeg",
    "companies": [
      "gameskraft.png"
    ],
    "ctc": "30L-35L",
    "review": "Very well structured course which helps you learn many new things everyday. It covers all aspects of the product based companies' interviews and is also helpful for all rounded growth. The mentors and instructors are very helpful throughout. The homework and questions are carefully selected and was very much helpful in practice.",
    "links": {
      "quora": "https://qr.ae/pGlcK4",
      "youtube": "https://youtu.be/EpEbE-6D2hs"
    }
  },
  {
    "name": "Sunkara Lakshmi Manasa",
    "image": "coderavatar.png",
    "companies": [
      "cashfree.png"
    ],
    "ctc": "30L-35L",
    "review": "From day one at Placewit till today, I think I have changed from a person who didn’t know that leetcode existed to a person who gets a daily check-in point at leetcode and who tries to solve a minimum number of problems daily. Thankfully, I am placed at Cash Free beacuse of Placewit.",
    "links": {
      "quora": "https://qr.ae/pvbXWl"
    }
  },
  {
    "name": "Manvith Yadav Dega",
    "image": "manvith-yadav-dega.jpeg",
    "companies": [
      "oracle.png"
    ],
    "ctc": "30L-35L",
    "review": "I would like to thank Aksht sir, Aman sir, Seemant sir, Ishaan sir, Himanshu sir, Shubhank sir, Amisha ma'am and all Placewit team for helping me build my DSA skills, WebD skills and communication skills. Finally, with all the hardwork, I have recieved an offer from Oracle at SDE position.",
    "links": {
      "quora": "https://qr.ae/pvJ3q3"
    }
  },
  {
    "name": "Ashish Upadhyaya",
    "image": "ashish-upadhyaya.jpeg",
    "companies": [
      "amagi.png"
    ],
    "ctc": "30L-35L",
    "review": "Rishabh sir(SWE @ google), whose teaching style was quite good. Vivek sir(SWE @ Microsoft) was also good but , Mukul sir(SWE @ Atlassian) teaching was the best and Yash Sir discussed doubts that we used to come up with. I found out about Placewit from whatsapp and find myself so grateful for that, for sure I will recommend my friends and juniors to join Placewit. Placewit is the best platform to learn coding !!",
    "links": {
      "quora": "https://qr.ae/pvOdjI"
    }
  },
  {
    "name": "Amar Singh",
    "image": "amarsingh.jpeg",
    "companies": [
      "walmart.png"
    ],
    "ctc": "20L-25L",
    "review": "Overall great structured program. Doubt support is amazingly good and quality of questions on each topic is to the point. Regular Interviews throughout the course which prepares for the unexpected and how to deal with questions which are not done previously. Development part is well programmed as well, be it WebD or ML."
  },
  {
    "name": "Prashant Kaushal",
    "image": "prashant-kaushal.jpeg",
    "companies": [
      "junglee.png"
    ],
    "ctc": "20L-25L",
    "review": "I joined Placewit because before my 3 years of college I didn't do much coding, I only used to study DSA and did only a few questions. So this situation made me worried about the upcoming placements. Hence, I decided to follow a structured path in 3rd year so that I could get a good grip on placements, therefore I joined Placewit and will recommend my friends also to do the same so that you won't regret it later.",
    "links": {
      "quora": "https://qr.ae/pvwbyU"
    }
  },
  {
    "name": "Sudev Dhali",
    "image": "sudev-dhali.jpg",
    "companies": [
      "sapient.png"
    ],
    "ctc": "20L-25L",
    "review": "Akshat Jain Sir(SDE @Rippling) was our mentor. He was a great teacher and really worked on us so that we can excel. Ishaan Sir(SDE @ Trilogy innovations) was our mentor. He helped us tremendously in growing confidence for interviews and really inculcated that within us. I used to be nervous earlier but now I am pretty confident in myself. I just wanna say it was really a great learning experience at placewit!!!",
    "links": {
      "quora": "https://qr.ae/pvg98f"
    }
  },
  {
    "name": "Siddhi Bhardwaj",
    "image": "siddhi-bhardwaj.jpeg",
    "companies": [
      "wellsfargo.png"
    ],
    "ctc": "20L-25L",
    "review": "I felt like an incomplete and under confident kid before joining placewit, but now I am confident. I came to learn all about placements which I didn't know at all before joining Placewit. It was an extraordinary experience in the end!",
    "links": {
      "quora": "https://qr.ae/pvwf0T"
    }
  },
  {
    "name": "Samar Vijeet",
    "image": "samar-vijeet.jpeg",
    "companies": [
      "fortinet.png"
    ],
    "ctc": "20L-25L",
    "review": "Mock interviews were really helpful, the feedback helped me a lot to improve. I joined placewit because nothing worked for me to resolve my consistency issue, also I wasn't able to find a good mentor to guide me until I met mentors at Placewit who guided me personally and tried to bring out the best in me.",
    "links": {
      "quora": "https://qr.ae/pvwfEO"
    }
  },
  {
    "name": "Abhishek Jain",
    "image": "abhishekjain.jpeg",
    "companies": [
      "dpworld.png"
    ],
    "ctc": "20L-25L",
    "review": "Very supportive and intellectual mentors with consistency, always there to help. Daily goals and strict deadlines with individual tracking helped to stay competitive and motivated. Lot of experience sharing by mentors and extra sessions guided to stick on right track."
  },
  {
    "name": "Arihant Shokeen",
    "image": "arihant-shokeen.jpeg",
    "companies": [
      "hono.png"
    ],
    "ctc": "20L-25L",
    "review": "Placewit is a lovely platform for preparation!! I will surely recommend placewit to juniors as it helps us to boost confidence and prepare well. I joined placewit for my placement preparation and to maintain consistency in my journey. The curriculum was excellent and the mentors were good too. The projects provided to us were of good quality and must tell that I meet all my expectations.",
    "links": {
      "quora": "https://qr.ae/pvbVQF"
    }
  },
  {
    "name": "Md Irshad",
    "image": "mdirshad.jpeg",
    "companies": [
      "walmart.png"
    ],
    "ctc": "20L-25L",
    "review": "It was great experience learning here. The teachers and mentors were very helpful. I would definitely recommend it to someone who really wants to get placed in tech giants.",
    "links": {
      "quora": "https://qr.ae/pGSe5Q"
    }
  },
  {
    "name": "Jahnavi Matsa",
    "image": "coderavatar.png",
    "companies": [
      "junglee.png"
    ],
    "ctc": "20L-25L",
    "review": "Regular classes used to be organized by Placewit which helped me in improving my coding skills and thinking ability to a great extent. By conducting mock interviews and placement preparation sessions helped us to clear all doubts and myths we used to have regarding the interviews. On day 1 I didn't know anything about DSA but now I am able to solve and understand any set of problems. At the end I just want to make request to Placewit for Increasing the number of batches so that many people get benefitted :)",
    "links": {
      "quora": "https://qr.ae/pvZlIT"
    }
  },
  {
    "name": "Arindam Paria",
    "image": "arindam-paria.png",
    "companies": [
      "sapient.png"
    ],
    "ctc": "20L-25L",
    "review": "My dsa has improved and my desire to learn more about algorithms has also increased a lot. I was totally satisfied with the dsa part. It was more than enough. My instructors were also so good. I personally thank placewit for making me so confident in dsa. Finally I got a placement offer from PUBLICIS SAPIENT at SDE position. Thanks a lot Placewit!!",
    "links": {
      "quora": "https://qr.ae/pvJuql"
    }
  },
  {
    "name": "Govind JS",
    "image": "govindjs.jpeg",
    "companies": [
      "oracle.png"
    ],
    "ctc": "15L-20L",
    "review": "As an Electronics student I always struggled whenever I tried to learn Competitive Programming by myself. I was afraid if I could crack a good placement. After joining Placewit, I was assigned great tutors and mentors. I was able to become really good in coding and got an opportunity to do some cool projects. During the placement drive, I was able to get placed in an amazing company."
  },
  {
    "name": "Tanuj Parkash",
    "image": "tanuj-parkash.jpeg",
    "companies": [
      "c-dot.png"
    ],
    "ctc": "15L-20L",
    "review": "Before placewit I was below average in coding. I just used to solve questions with a brute force approach. After Placewit, I saw a significant change in myself. Now I am able to solve any kind of standard problem even with tricky follow ups. Thanks a lot to the entire Placewit team for the wonderful, fun and knowledge filled journey.",
    "links": {
      "quora": "https://qr.ae/pvmg0m"
    }
  },
  {
    "name": "Anurag Phulware",
    "image": "anuragphulware.jpeg",
    "companies": [
      "amex-hz.png",
      "blogvault.png"
    ],
    "ctc": "14L-18L",
    "review": "It was a great journey. Got a clear roadmap of what really needs to be done for placement. The instructors and mentors were extremely supportive and the whole teaching process is simply flawless. It has really helped me, would definitely recommend for well planned development of one self in every sense a programmer should.",
    "links": {
      "quora": "https://qr.ae/pGSewn",
      "youtube": "https://youtu.be/wY-sznPWWAI"
    }
  },
  {
    "name": "Shubhi Singh",
    "image": "shubhi-singh.jpeg",
    "companies": [
      "thoughtspot.png",
      "amazon.png"
    ],
    "ctc": "15L-20L",
    "review": "I appreciate every member of this team for the hard work you did for us. Wherever I reach in my career, your contribution to leading me on the right path in these seven months will be something I will always be thankful for. I have improved and grown a lot if I see where I was on day 1 of placewit.",
    "links": {
      "quora": "https://qr.ae/pvbXsG"
    }
  },
  {
    "name": "Neel B Majethiya",
    "image": "neel-b-majethiya.jpeg",
    "companies": [
      "oracle.png"
    ],
    "ctc": "15L-20L",
    "review": "I was always struggling to prepare for Placement Season and was looking for a Complete Interview preparation course with Proper Guidance and loved the Demo Class therefore I decided to join this course. I would like to thank all my mentors and team Placewit whose collective efforts finally got me placed in Oracle!",
    "links": {
      "quora": "https://qr.ae/pvbQ3Z"
    }
  },
  {
    "name": "Siddareddygari Amrutha",
    "image": "amrutha.png",
    "companies": [
      "deutsche.png"
    ],
    "ctc": "15L-20L",
    "review": "I would definitely recommend it to others also because placewit not only teaches us about studies it also makes us learn many things about life. Placewit cares for everyone. I didn't even think I would get placed that fast. But I did get placed within 15 days since placements started at Deutsche Bank. That shows how much I have learnt from Placewit and how much Placewit has changed me.",
    "links": {
      "quora": "https://qr.ae/pvZm33"
    }
  },
  {
    "name": "Rao Abuzar",
    "image": "raoabuzar.jpeg",
    "companies": [
      "infoedge.png",
      "olaelectricbg.png"
    ],
    "ctc": "15L-20L",
    "review": "It was great to be a part of a classroom that always had something to learn, something to discuss. For a non-CS background student like me (little to no prior experience in DSA, CP, or Web), it was very welcoming and inclusive. Placewit gives time to every student to figure out the concepts and find one's strengths and weaknesses and work on overcoming their weaknesses. P.S: Placewit mentors, you guys showed a good amount of patience with me. Keep trying with students like me and make them feel capable."
  },
  {
    "name": "Zeeshan Quamar ",
    "image": "zeeshan.jpeg",
    "companies": [
      "c-dot.png"
    ],
    "ctc": "15L-20L",
    "review": "I will definitely encourage my juniors to join Placewit for structured learning and getting placed at good companies with high CTCs. The batch size was really very small; around 25 students were there in my batch, so instructors gave attention to all the students individually, the classes were always two way communication. I always get my doubts cleared from the instructor. Placewit you are just awesome!!",
    "links": {
      "quora": "https://qr.ae/pvOGi5"
    }
  }
]
